onionc/mcu/STM32/STM32_HAL/A001.SPI_TCAN4550EVM/Drivers/tcan4x5x/Inc/TCAN4x5x_Data_Structs.h
typedef enum
{
    TCAN4x5x_DEV_CONFIG_WDT_ACTION_nINT = 0,
    TCAN4x5x_DEV_CONFIG_WDT_ACTION_PULSE_INH = 1,
    TCAN4x5x_DEV_CONFIG_WDT_ACTION_PULSE_WDT_OUTPUT = 2
} TCAN4x5x_DEV_CONFIG_WDT_ACTION;

typedef enum
{
    TCAN4x5x_DEV_CONFIG_GPO2_NO_ACTION = 0,
    TCAN4x5x_DEV_CONFIG_GPO2_MCAN_INT0 = 1,
    TCAN4x5x_DEV_CONFIG_GPO2_WATCHDOG = 2,
    TCAN4x5x_DEV_CONFIG_GPO2_MIRROR_INT = 3
} TCAN4x5x_DEV_CONFIG_GPO2_CONFIG;

typedef enum
{
    TCAN4x5x_DEV_CONFIG_WAKE_DISABLED = 0,
    TCAN4x5x_DEV_CONFIG_WAKE_RISING_EDGE = 1,
    TCAN4x5x_DEV_CONFIG_WAKE_FALLING_EDGE = 2,
    TCAN4x5x_DEV_CONFIG_WAKE_BOTH_EDGES = 3
} TCAN4x5x_DEV_CONFIG_WAKE_CONFIG;

typedef struct
{
    union
    {
        //! Full word for register
        uint32_t word;

        struct
        {
            //! @brief DEV_MODE_PINS[0] : Test mode configuration. Reserved in this struct
            //! It is recommended to use the test mode function to enable or disable test mode rather than this struct
            uint8_t RESERVED0 : 1;

            //! @brief DEV_MODE_PINS[1] : Sleep wake error disable.
            //! Setting this to 1 will disable the 4 minute timer that puts the part back to sleep if no activity is detected
            uint8_t SWE_DIS: 1;

            //! @brief DEV_MODE_PINS[2] : Device reset. Write a 1 to perform a reset on the part
            uint8_t DEVICE_RESET : 1;

            //! @brief DEV_MODE_PINS[3] : Watchdog Enable. Use the watchdog functions to control enabling the watchdog
            uint8_t WD_EN : 1;

            //! @brief Reserved
            //! @brief DEV_MODE_PINS[7:6] : Mode Selection. Use the mode functions to change the mode
            uint8_t RESERVED1 : 4;

            //! @brief DEV_MODE_PINS[8] : nWKRQ Configuration
            //! 0: Mirrors INH function
            //! 1: Wake request interrupt
            uint8_t nWKRQ_CONFIG : 1;

            //! @brief DEV_MODE_PINS[9] : Inhibit pin disable
            uint8_t INH_DIS : 1;

            //! @brief DEV_MODE_PINS[11:10] : GPIO1 pin as a GPO function configuration
            //! Configures the behavior of GPIO1 if it is configured to be a GPO
            //! Available values are:
            //! TCAN4x5x_DEV_CONFIG_GPO1_SPI_FAULT_INT : Active low output for a SPIERR
            //! TCAN4x5x_DEV_CONFIG_GPO1_MCAN_INT1 : Active low output for MCAN_INT1 output (See MCAN ILE and ILS registers to use)
            //! TCAN4x5x_DEV_CONFIG_GPO1_UNDER_VOLTAGE_OR_THERMAL_INT : Active low output for any under voltage or over temp interrupt
            TCAN4x5x_DEV_CONFIG_GPO1_CONFIG GPIO1_GPO_CONFIG : 2;

            //! @brief Reserved
            uint8_t RESERVED2 : 1;

            //! @brief DEV_MODE_PINS[13] : Fail safe mode enable. Excludes power up fail safe
            uint8_t FAIL_SAFE_EN : 1;

            //! @brief DEV_MODE_PINS[15:14] : GPIO1 configuration
            //! Configures the mode of the GPIO1 pin as an input or output
            //! Available values are:
            //! TCAN4x5x_DEV_CONFIG_GPIO1_CONFIG_GPO : Sets GPIO1 as an output. Be sure to see GPIO1_GPO_CONFIG field to set the behavior
            //! TCAN4x5x_DEV_CONFIG_GPIO1_CONFIG_WATCHDOG_INPUT : Sets GPIO1 as an input for the watchdog timer. Watchdog will need to be enabled
            TCAN4x5x_DEV_CONFIG_GPIO1_CONFIG GPIO1_CONFIG : 2;

            //! @brief DEV_MODE_PINS[17:16] : Watchdog action. Defines the behavior of the watchdog timer when it times out
            //! Sets the behavior of the watchdog when it times out
            //! Available values are:
            //! TCAN4x5x_DEV_CONFIG_WDT_ACTION_nINT : Sets an interrupt flag and the interrupt pin will be pulled low
            //! TCAN4x5x_DEV_CONFIG_WDT_ACTION_PULSE_INH : Pulse INH low for ~300 ms then high
            //! TCAN4x5x_DEV_CONFIG_WDT_ACTION_PULSE_WDT_OUTPUT : Pulse the watchdog output pin low for ~300 ms and high
            TCAN4x5x_DEV_CONFIG_WDT_ACTION WD_ACTION : 2;


            //! @brief DEV_MODE_PINS[18] : Watchdog reset bit
            //! Write a 1 to reset the watchdog timer. It's recommended to use the other watchdog functions for this behavior
            uint8_t WD_BIT_RESET : 1;

            //! @brief DEV_MODE_PINS[19] : nWKRQ_VOLTAGE, set the voltage rail used by the nWKRQ pin
            //! Available values are:
            //! 0 [default] : Internal Voltage rail
            //! 1           : VIO Voltage rail
            uint8_t nWKRQ_VOLTAGE : 1;

            //! @brief DEV_MODE_PINS[21:20] : RESERVED. Use test mode functions to enable test modes
            uint8_t RESERVED3 : 2;

            //! @brief DEV_MODE_PINS[23:22] : nWKRQ_VOLTAGE, set the voltage rail used by the nWKRQ pin
            //! Available values are:
            //! TCAN4x5x_DEV_CONFIG_GPO2_NO_ACTION  [default] : No action for GPO2
            //! TCAN4x5x_DEV_CONFIG_GPO2_MCAN_INT0 : Used as an output for MCAN INT0
            //! TCAN4x5x_DEV_CONFIG_GPO2_WATCHDOG : Used as a watchdog output
            //! TCAN4x5x_DEV_CONFIG_GPO2_MIRROR_INT : Mirror nINT pin
            TCAN4x5x_DEV_CONFIG_GPO2_CONFIG GPO2_CONFIG : 2;

            //! @brief DEV_MODE_PINS[26:24] : RESERVED
            uint8_t RESERVED4 : 3;

            //! @brief DEV_MODE_PINS[27] : CLK_REF, used to tell the device what the input clock/crystal frequency is
            //! Available values are:
            //! 0           : 20 MHz
            //! 1 [default] : 40 MHz
            uint8_t CLK_REF : 1;

            //! @brief DEV_MODE_PINS[29:28] : RESERVED. Use watchdog functions to set watchdog parameters
            uint8_t RESERVED5 : 2;


            //! brief DEV_MODE_PINS[31:30] : WAKE_CONFIG, used to configure the direction required to wake a part up
            //! Available values are:
            //! TCAN4x5x_DEV_CONFIG_WAKE_DISABLED             : Disabled. Wake pin is not used
            //! TCAN4x5x_DEV_CONFIG_WAKE_RISING_EDGE          : Low to high transition will wake the part
            //! TCAN4x5x_DEV_CONFIG_WAKE_FALLING_EDGE         : High to low transition will wake the part
            //! TCAN4x5x_DEV_CONFIG_WAKE_BOTH_EDGES [default] : Either transition will wake the part
            TCAN4x5x_DEV_CONFIG_WAKE_CONFIG WAKE_CONFIG : 2;
        };
    };
} TCAN4x5x_DEV_CONFIG;


#endif /* TCAN4X5X_DATA_STRUCTS_H_ */
